const MEDAL_POSITIONS = {
    male: {
        police: {
            regular: {
                hero: [373, 273],
                1: [276, 408],
                2: [310, 408],
                3: [346, 408],
                4: [382, 408],
                5: [416, 408],
                6: [276, 475],
                7: [310, 475],
                8: [346, 475],
                9: [382, 475],
                10: [416, 475],
                11: [276, 542],
                12: [310, 542]
            },
            general: {
                hero: [373, 273],
                1: [276, 408],
                2: [310, 408],
                3: [346, 408],
                4: [382, 408],
                5: [416, 408],
                6: [276, 475],
                7: [310, 475],
                8: [346, 475],
                9: [382, 475],
                10: [416, 475],
                11: [276, 542],
                12: [310, 542]
            }
        },
        vnz: {
            regular: {
                hero: [367, 303],
                1: [282, 438],
                2: [316, 438],
                3: [352, 438],
                4: [388, 438],
                5: [422, 438],
                6: [281, 504],
                7: [316, 504],
                // Координаты для текста на шевроне
                chevronText: {
                    x: 392,
                    y: 509.5,
                    maxWidth: 220,
                    rotation: 1.2 * Math.PI / 180 // Преобразуем градусы в радианы
                }
            },
            general: {
                hero: [367, 303],
                1: [282, 438],
                2: [316, 438],
                3: [352, 438],
                4: [388, 438],
                5: [422, 438],
                6: [281, 504],
                7: [316, 504],
                // Координаты для текста на шевроне
                chevronText: {
                    x: 392,
                    y: 509.5,
                    maxWidth: 220,
                    rotation: 1.2 * Math.PI / 180 // Преобразуем градусы в радианы
                }
            }
        },
        justice: {
            regular: {
                hero: [373, 273],
                1: [276, 408],
                2: [310, 408],
                3: [346, 408],
                4: [382, 408],
                5: [416, 408],
                6: [276, 475],
                7: [310, 475],
                8: [346, 475],
                9: [382, 475],
                10: [416, 475],
                11: [276, 542],
                12: [310, 542]
            },
            general: {
                hero: [373, 273],
                1: [276, 408],
                2: [310, 408],
                3: [346, 408],
                4: [382, 408],
                5: [416, 408],
                6: [276, 475],
                7: [310, 475],
                8: [346, 475],
                9: [382, 475],
                10: [416, 475],
                11: [276, 542],
                12: [310, 542]
            }
        }
    },
    female: {
        police: {
            regular: {
                hero: [375, 300-25],
                1: [278, 435-25],
                2: [312, 435-25],
                3: [348, 435-25],
                4: [384, 435-25],
                5: [418, 435-25],
                6: [277, 502-25],
                7: [312, 502-25],
                8: [348, 502-25],
                9: [384, 502-25],
                10: [418, 502-25],
                11: [277, 569-25],
                12: [312, 569-25]
            },
            general: {
                hero: [373, 273],
                1: [276, 408],
                2: [310, 408],
                3: [346, 408],
                4: [382, 408],
                5: [416, 408],
                6: [276, 475],
                7: [310, 475],
                8: [346, 475],
                9: [382, 475],
                10: [416, 475],
                11: [276, 542],
                12: [310, 542]
            }
        },
        vnz: {
            regular: {
                hero: [375, 300],
                1: [278, 435],
                2: [312, 435],
                3: [348, 435],
                4: [384, 435],
                5: [418, 435],
                6: [277, 502],
                7: [312, 502],
                chevronText: {
                    x: 394,
                    y: 330,
                    maxWidth: 190,
                    rotation: 1.32 * Math.PI / 180
                }
            },
            general: {
                hero: [373, 273],
                1: [276, 408],
                2: [310, 408],
                3: [346, 408],
                4: [382, 408],
                5: [416, 408],
                6: [276, 475],
                7: [310, 475],
                chevronText: {
                    x: 394,
                    y: 306,
                    maxWidth: 190,
                    rotation: 1.32 * Math.PI / 180
                }
            }
        },
        justice: {
            regular: {
               hero: [375, 300-25],
                1: [278, 435-25],
                2: [312, 435-25],
                3: [348, 435-25],
                4: [384, 435-25],
                5: [418, 435-25],
                6: [277, 502-25],
                7: [312, 502-25],
                8: [348, 502-25],
                9: [384, 502-25],
                10: [418, 502-25],
                11: [277, 569-25],
                12: [312, 569-25]
            },
            general: {
                hero: [373, 273],
                1: [276, 408],
                2: [310, 408],
                3: [346, 408],
                4: [382, 408],
                5: [416, 408],
                6: [276, 475],
                7: [310, 475],
                8: [346, 475],
                9: [382, 475],
                10: [416, 475],
                11: [276, 542],
                12: [310, 542]
            }
        }
    }
};

const RIBBON_POSITIONS = {
    male: {
        police: {
            regular: {
                hero: [373, 273],
                1: [302, 421],
                2: [346, 421],
                3: [389, 421],
                4: [433, 421],
                5: [323, 439],
                6: [369, 439],
                7: [414, 439]
            },
            general: {
                hero: [373, 273],
                1: [302, 421],
                2: [346, 421],
                3: [389, 421],
                4: [433, 421],
                5: [323, 439],
                6: [369, 439],
                7: [414, 439]
            }
        },
        vnz: {
            regular: {
                hero: [386, 219],
                1: [304, 385],
                2: [347, 385],
                3: [389, 385],
                4: [432, 385],
                5: [327, 403],
                6: [371, 403],
                7: [417, 403],
                chevronText: {
                    x: 392,
                    y: 509.5,
                    maxWidth: 220,
                    rotation: 1.2 * Math.PI / 180 // Преобразуем градусы в радианы
                }
            },
            general: {
                hero: [386, 219],
                1: [304, 385],
                2: [347, 385],
                3: [389, 385],
                4: [432, 385],
                5: [327, 403],
                6: [371, 403],
                7: [417, 403],
                chevronText: {
                    x: 392,
                    y: 509.5,
                    maxWidth: 220,
                    rotation: 1.2 * Math.PI / 180 // Преобразуем градусы в радианы
                }
            }
        },
        justice: {
            regular: {
                hero: [373, 273],
                1: [302, 421],
                2: [346, 421],
                3: [389, 421],
                4: [433, 421],
                5: [323, 439],
                6: [369, 439],
                7: [414, 439]
            },
            general: {
                hero: [373, 273],
                1: [302, 421],
                2: [346, 421],
                3: [389, 421],
                4: [433, 421],
                5: [323, 439],
                6: [369, 439],
                7: [414, 439]
            }
        }
    },
    female: {
        police: {
            regular: {
                hero: [375, 300],
                1: [297, 438],       
                2: [339, 438],
                3: [384, 438],
                4: [428, 438],
                5: [316, 456],      
                6: [364, 456],
                7: [409, 456]
            },
            general: {
                hero: [373, 273],
                1: [302, 421],
                2: [346, 421],
                3: [389, 421],
                4: [433, 421],
                5: [323, 439],
                6: [369, 439],
                7: [414, 439]
            }
        },
        vnz: {
            regular: {
                hero: [386, 219],
                1: [304, 385],
                2: [347, 385],
                3: [389, 385],
                4: [432, 385],
                5: [327, 403],
                6: [371, 403],
                7: [417, 403],
                chevronText: {
                    x: 392,
                    y: 509.5,
                    maxWidth: 220,
                    rotation: 1.2 * Math.PI / 180 // Преобразуем градусы в радианы
                }
            },
            general: {
                hero: [386, 219],
                1: [304, 385],
                2: [347, 385],
                3: [389, 385],
                4: [432, 385],
                5: [327, 403],
                6: [371, 403],
                7: [417, 403],
                chevronText: {
                    x: 392,
                    y: 509.5,
                    maxWidth: 220,
                    rotation: 1.2 * Math.PI / 180 // Преобразуем градусы в радианы
                }
            }
        },
        justice: {
            regular: {
                hero: [375, 300],
                1: [297, 438],       
                2: [339, 438],
                3: [384, 438],
                4: [428, 438],
                5: [316, 456],      
                6: [364, 456],
                7: [409, 456]
            },
            general: {
                hero: [373, 273],
                1: [302, 421],
                2: [346, 421],
                3: [389, 421],
                4: [433, 421],
                5: [323, 439],
                6: [369, 439],
                7: [414, 439]
            }
        }
    }
};

const MEDAL_HIERARCHY = [
    'ugibdd_9years',       // Памятная юбилейная медаль «9 лет Управлению ГИБДД»
    'ugibdd_ob_conscientious',       // Медаль «За добросовестную службу в ОБ ДПС УГИБДД»
    'ugibdd_osb_conscientious',       // Медаль «За добросовестную службу в ОСБ ДПС УГИБДД»
    'ugibdd_management',       // Медаль «За заслуги в управленческой деятельности УГИБДД»
    'ugibdd_impeccable',       // Медаль «За безупречную службу в УГИБДД»
    'science',      // За заслуги в научной и педагогической деятельности
    'road',         // За укрепление безопасности дорожного движения
    'putilin',      // И.Д. Путилина
    'labor',        // За трудовую доблесть
    'special',      // За заслуги в особых условиях
    'courage',      // За смелость во имя спасения
    'valor',        // За доблесть в службе
    'hero'          // Герой Республики Провинция
];

const MEDAL_FILES = {
    full: {
        hero: 'img/medals/full/hero.png',
        valor: 'img/medals/full/valor.png',
        courage: 'img/medals/full/courage.png',
        special: 'img/medals/full/special.png',
        labor: 'img/medals/full/labor.png',
        putilin: 'img/medals/full/putilin.png',
        road: 'img/medals/full/road.png',
        science: 'img/medals/full/science.png',
        ugibdd_impeccable: 'img/medals/full/ugibdd_impeccable.png',
        ugibdd_management: 'img/medals/full/ugibdd_management.png',
        ugibdd_osb_conscientious: 'img/medals/full/ugibdd_osb_conscientious.png',
        ugibdd_ob_conscientious: 'img/medals/full/ugibdd_ob_conscientious.png',
        ugibdd_9years: 'img/medals/full/ugibdd_9years.png'
    },
    ribbons: {
        hero: 'img/medals/ribbons/hero.png',
        valor: 'img/medals/ribbons/valor.png',
        courage: 'img/medals/ribbons/courage.png',
        special: 'img/medals/ribbons/special.png',
        labor: 'img/medals/ribbons/labor.png',
        putilin: 'img/medals/ribbons/putilin.png',
        road: 'img/medals/ribbons/road.png',
        science: 'img/medals/ribbons/science.png'
    }
};

const POSITION_RULES = {
    1: [3],                    // Если 1 медаль - на 3 позицию
    2: [3, 4],                 // Если 2 медали - на 3 и 4
    3: [2, 3, 4],              // Если 3 медали - на 2, 3, 4
    '4+': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13] // Если 4 и более - на все позиции с 1
};

const GENERAL_RANKS = [
    'genmayor',
    'genleytenant', 
    'genpolkovnik'
];

// Доступные звания для ВНГ (теперь включая полковника)
const VNZ_AVAILABLE_RANKS = [
    'leytenant',
    'starlyeytenant',
    'kapitan',
    'mayor',
    'podpolkovnik',
    'polkovnik'  // Добавлен полковник
];
